case.template/0.orig/taufirst
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      taufirst;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include		"<constant>/caseSetup"

dimensions		[1 -1 -2 0 0 0 0];

internalField	uniform (0 0 0 0 0 0);

boundaryField
{
	inlet
	{
		type			fixedValue;
		value			$internalField;
	}

	outlet
	{
		type			zeroGradient;
	}

	"wall.*"
	{
		type			zeroGradient;
	}

	"symmetry.*"
	{
		type			symmetry;
	}

	"empty.*"
	{
		type			empty;
	}
}

// ************************************************************************* //
