case.template/constant/caseSetup
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
	class		IODictionary;
    location    "constant";
    object      caseSetup;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// geometry
R			1;						// pipe radius
a			#eval{ 0.667*$R };		// stenosis height
b			#eval{ 4*$R };			// stenosis half-length
L			#eval{ 50*$R };			// inlet/outlet length

// flow quantities
Re			200;					// Reynolds number

// blood
rhoS		1060;					// density of solvent
muS			0.0012;					// dynamic viscosity of solvent
muTot		0.0548;					// total dynamic viscosity (multi-mode)

// avg. inlet velocity (multi-mode)
//u_avg		#eval{ vector($Re*$muTot / (2*$R*$rhoS), 0, 0) };
u_avg		#eval{ vector($Re*$muS / (2*$R*$rhoS), 0, 0) };

// as per Hagen-Poiseuille flow solution
u_max		#eval{ 2*$[(vector) u_avg] };


#inputMode merge

// ************************************************************************* //
