case.template/constant/viscoelasticProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      viscoelasticProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include		"<constant>/caseSetup";

/* NOTE:
 * multi-mode PTT and Newtonian coefficients taken directly from
 * Chauhan & Sasmal (2021), while Carreau-Yasuda coefficients were fitted to
 * the 'same' data (actually fitted to data directly from
 * Yeleswarapu et al. 1998).
 */

rheology
{
	type			Newtonian;

	NewtonianCoeffs
	{
		rho				rho		[1 -3  0 0 0 0 0] $:rhoS;
		eta				eta		[1 -1 -1 0 0 0 0] $:muS;
	}

	CarreauYasudaCoeffs
	{
		rho				rho		[1 -3  0 0 0 0 0] $:rhoS;
		etaInf			etaInf	[1 -1 -1 0 0 0 0] 0.0048183;
		eta0			eta0	[1 -1 -1 0 0 0 0] 0.2379270;
		k				k		[0  0  1 0 0 0 0] 12.7503680;
		a				a		[0  0  0 0 0 0 0] 1.46659544;
		n				n		[0  0  0 0 0 0 0] 0.42239623;
	}

	multiModeCoeffs
	{
		models
		(
			first
			{
				type			PTT-Linear;
				PTT-LinearCoeffs
				{
					rho				rho		[1 -3  0 0 0 0 0] $:rhoS;
					etaS			etaS	[1 -1 -1 0 0 0 0] $:muS;
					etaP			etaP	[1 -1 -1 0 0 0 0] 0.05;
					lambda			lambda	[0  0  1 0 0 0 0] 7;
					epsilon			epsilon	[0  0  0 0 0 0 0] 0.2;
					zeta			zeta	[0  0  0 0 0 0 0] 0.0;
				}
			}

			second
			{
				type			PTT-Linear;
				PTT-LinearCoeffs
				{
					rho				rho		[1 -3  0 0 0 0 0] $:rhoS;
					etaS			etaS	[1 -1 -1 0 0 0 0] $:muS;
					etaP			etaP	[1 -1 -1 0 0 0 0] 0.001;
					lambda			lambda	[0  0  1 0 0 0 0] 0.4;
					epsilon			epsilon	[0  0  0 0 0 0 0] 0.5;
					zeta			zeta	[0  0  0 0 0 0 0] 0.0;
				}
			}

			third
			{
				type			PTT-Linear;
				PTT-LinearCoeffs
				{
					rho				rho		[1 -3  0 0 0 0 0] $:rhoS;
					etaS			etaS	[1 -1 -1 0 0 0 0] $:muS;
					etaP			etaP	[1 -1 -1 0 0 0 0] 0.001;
					lambda			lambda	[0  0  1 0 0 0 0] 0.04;
					epsilon			epsilon	[0  0  0 0 0 0 0] 0.5;
					zeta			zeta	[0  0  0 0 0 0 0] 0.0;
				}
			}

			fourth
			{
				type			PTT-Linear;
				PTT-LinearCoeffs
				{
					rho				rho		[1 -3  0 0 0 0 0] $:rhoS;
					etaS			etaS	[1 -1 -1 0 0 0 0] $:muS;
					etaP			etaP	[1 -1 -1 0 0 0 0] 0.0016;
					lambda			lambda	[0  0  1 0 0 0 0] 0.006;
					epsilon			epsilon	[0  0  0 0 0 0 0] 0.5;
					zeta			zeta	[0  0  0 0 0 0 0] 0.0;
				}
			}
		);
	}
}


// ************************************************************************* //
