case.template/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include		"<constant>/caseSetup";

short_write		5;
long_write		50;

application		viscoelasticSimpleFoam;

startFrom		startTime;

startTime		0;

stopAt			endTime;

endTime			5000;

deltaT			1;

writeControl	timeStep;

writeInterval	$long_write;

purgeWrite		5;

writeFormat		binary;

writePrecision	6;

writeCompression false;

timeFormat		general;

timePrecision	6;

runTimeModifiable yes;

functions
{
	// field generating stuff
	#include	"post/p_bar"
	#include	"post/u_bar"
	#include	"post/viscoelastic_wall_shear_stress"

	// sampling
	#include	"post/field_min_max"
	#include	"post/viscoelastic_forces"
	#include	"post/probes"
	#include	"post/single_graph"
	#include	"post/stream_line"

	// images
	#include	"post/runtime_postprocessing"

	//#include	"post/time_activated_file_update"
}


// ************************************************************************* //
