case.template/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
	//default			Crank-Nicolson 0.9;
	default				steadyState;
}

gradSchemes
{
	//default				Gauss linear;
	//default				cellLimited leastSquares 1;
	default				leastSquares;
}

divSchemes
{
	default				none;
	div(phi,U)			bounded Gauss linearUpwindV leastSquares;
	//div(phi,U)			bounded Gauss upwind;

	"div\(phi,tau.*\)"	bounded Gauss linearUpwind leastSquares;
	//"div\(phi,tau.*\)"	bounded Gauss upwind;

	div(tau)			Gauss linear;
}

laplacianSchemes
{
	default				Gauss linear corrected;
}

interpolationSchemes
{
	default				linear;
}

snGradSchemes
{
	default				corrected;
}

wallDist
{
	method				meshWave;
}


// ************************************************************************* //
