case.template/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ofGamgConfig
{
	//smoother				GaussSeidel;
	smoother				FDIC;

	minIter					2;
	maxIter					50;
	nPreSweeps				1;
	nPostSweeps				2;
	nFinestSweeps			2;

	scaleCorrection			true;
	interpolateCorrection	false;
	directSolverCoarsestLevel false;

	coarsestLevelCorr
	{
		solver				PCG;
		preconditioner		DIC;

		relTol				0.075;
	}

	agglomerator			faceAreaPair;
	cacheAgllomeration		true;
	nCellsInCoarsestLevel	512;
	mergeLevels				1;
}

solvers
{
	p
	{
		solver					GAMG;
		$ofGamgConfig;

		tolerance				1e-07;
		relTol					1e-3;
	}

	pFinal
	{
		$p

		tolerance				1e-07;
		relTol					0;
	}

	"(U|tau.*)"
	{
		solver					PBiCGStab;
		preconditioner			DILU;

		minIter					2;
		tolerance				1e-08;
		relTol					1e-4;
	}

	"(U|tau.*)Final"
	{
		$U
		tolerance				1e-8;
		relTol					0;
	}
}

SIMPLE
{
	nNonOrthogonalCorrectors 0;

	residualControl
	{
		U				1e-4;
		p				1e-4;
		"tau.*"			1e-4;
	}
}

PIMPLE
{
	correctPhi			false;
	momentumPredictor	true;

	nOuterCorrectors	250;
	nCorrectors			1;
	nNonOrthogonalCorrectors 0;

	residualControl
	{
		U
		{
			tolerance	1e-4;
			relTol		0;
		}
		p
		{
			tolerance	1e-4;
			relTol		0;
		}
		tau
		{
			tolerance	1e-4;
			relTol		0;
		}
	}
}

relaxationFactors
{
	fields
	{
		p			0.25;
		".*Final"	1;
	}

	equations
	{
		U			0.7;
		"tau.*"		0.25;
		".*Final"	1;
	}
}

cache
{
	grad(U);
}

// ************************************************************************* //
