case.template/system/post/p_bar
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

p_bar
{
	type			pBar;
	writeControl	timeStep;
	writeInterval	$long_write;
	log				false;

	URef			#eval{ mag($[(vector) u_avg]) };
}

// ************************************************************************* //
