case.template/system/post/single_graph
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

single_graph.axial
{
	type			sets;
	libs			( "libsampling.so" );
	writeControl	onEnd;
	setFormat		csv;

	interpolationScheme	cellPatchConstrained;

	fields			( p pBar );

	sets
	(
		axis
		{
			type	face;
			axis	x;
			start	( #eval{ -$:b - $:L } 0 0 );
			end		( #eval{  $:b + $:L } 0 0 );
		}
	);
}

single_graph.radial
{
	type			sets;
	libs			( "libsampling.so" );
	writeControl	onEnd;
	setFormat		csv;

	interpolationScheme	cell;

	fields			( U UBar );

	sets
	(
		axis
		{
			type	midPoint;
			axis	y;
			start	( 0 0   0 );
			end		( 0 $:a 0 );
		}
	);
}

// ************************************************************************* //
