case.template/system/post/stream_line
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

stream_line
{
    type  streamLine;
    libs  (	"libfieldFunctionObjects.so" );
	writeControl    timeStep;
	writeInterval   $long_write;

    setFormat       vtk;

    // Velocity field to use for tracking.
    U               U;

	direction       bidirectional;
	//trackLength     108;

    // Names of fields to sample. Should contain above velocity field!
    fields          (p U);

    // Steps particles can travel before being removed
    lifeTime        10000;

    // Number of steps per cell (estimate). Set to 1 to disable subcycling.
    nSubCycle       5;

    // Cloud name to use
    cloud           particleTracks;

    // Seeding method.
    seedSampleSet
    {
        type        uniform;
        axis        x;  //distance;

        // Note: tracks slightly offset so as not to be on a face
        start       (0 0 0);
        end         (5 1 0);
        nPoints     20;
    }
}


// ************************************************************************* //
