case.template/system/post/viscoelastic_forces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

viscoelastic_forces.stenosis
{
	type			viscoelasticForces;
	executeControl	timeStep;
	executeInterval	$short_write;
	writeControl	timeStep;
	writeInterval	$short_write;
	log				false;
	p				p;
	U				U;
	CofR			( 0 0 0 );
	patches			( wall.stenosis );
}


viscoelastic_forces.wall
{
	type			viscoelasticForces;
	executeControl	timeStep;
	executeInterval	$short_write;
	writeControl	timeStep;
	writeInterval	$short_write;
	log				false;
	p				p;
	U				U;
	CofR			( 0 0 0 );
	patches			( "wall.*" );
}

// ************************************************************************* //
