case.template/system/post/viscoelastic_wall_shear_stress
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

wall_shear_stress
{
	type			viscoelasticWallShearStress;
	writeControl	timeStep;
	writeInterval	$long_write;
	log				false;

	patches			( "wall.*" );
}

// ************************************************************************* //
