case.template/system/tools/fvSchemes.0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
	default			Euler;
}

gradSchemes
{
	//default		 cellLimited leastSquares 1;
	default			leastSquares;
}

divSchemes
{
	default			none;
	div(phi,U)		Gauss upwind;

	div((nuEff*dev2(T(grad(U)))))	Gauss linear;
}

laplacianSchemes
{
	default			Gauss linear corrected;
}

interpolationSchemes
{
	default			linear;
}

snGradSchemes
{
	default			corrected;
}

wallDist
{
	method			meshWave;
}


// ************************************************************************* //
